{
  "template_id": "openagreements-employee-ip-inventions-assignment",
  "layout_id": "cover-standard-signature-v1",
  "style_id": "openagreements-default-v1",
  "output_docx_path": "content/templates/openagreements-employee-ip-inventions-assignment/template.docx",
  "output_markdown_path": "content/templates/openagreements-employee-ip-inventions-assignment/template.md",
  "document": {
    "title": "Employee IP and Inventions Assignment Agreement",
    "label": "OpenAgreements Employee IP and Inventions Assignment",
    "version": "1.1",
    "license": "Free to use under CC BY 4.0",
    "include_cloud_doc_line": true
  },
  "sections": {
    "cover_terms": {
      "section_label": "Cover Terms",
      "heading_title": "Cover Terms",
      "subtitle": "The key business terms of this assignment agreement are as follows.",
      "rows": [
        { "label": "Company", "value": "{company_name}" },
        { "label": "Employee", "value": "{employee_name}" },
        { "label": "Effective Date", "value": "{effective_date}" },
        { "label": "Prior Inventions Disclosure", "value": "{prior_inventions_disclosure}" },
        { "label": "Excluded Inventions Statement", "value": "{excluded_inventions_statement}" },
        { "label": "Confidential Information Definition", "value": "{confidential_information_definition}" },
        { "label": "Return of Materials Timing", "value": "{return_of_materials_timing}" },
        { "label": "Post-Termination Assistance", "value": "{post_termination_assistance}" },
        { "label": "Governing Law", "value": "{governing_law}" },
        { "label": "Venue", "value": "{venue}" }
      ]
    },
    "standard_terms": {
      "section_label": "Standard Terms",
      "heading_title": "Standard Terms",
      "clauses": [
        {
          "heading": "Assignment of Inventions",
          "body": "Employee assigns and agrees to assign to Company all right, title, and interest in inventions, software, works of authorship, discoveries, designs, data models, and related intellectual property created during employment that arise from Company work, use Company resources, or relate to Company actual or anticipated business, to the extent permitted by law."
        },
        {
          "heading": "Work Made for Hire and Further Assurances",
          "body": "To the extent legally permitted, copyrightable works prepared within the scope of employment are works made for hire for Company. If any rights do not automatically vest in Company, Employee assigns those rights and will sign additional documents reasonably requested to confirm ownership and record assignments."
        },
        {
          "heading": "Disclosure and Documentation",
          "body": "Employee will promptly disclose covered inventions and maintain reasonably complete records needed to document conception, authorship, development, and transfer of rights for Company business, consistent with lawful policy and confidentiality obligations."
        },
        {
          "heading": "Prior and Excluded Inventions",
          "body": "Inventions identified in Cover Terms as prior or excluded remain carved out only to the extent permitted by applicable law. Employee represents that the prior inventions disclosure in Cover Terms is complete to Employee knowledge as of the Effective Date."
        },
        {
          "heading": "Confidential Information and Trade Secrets",
          "body": "Employee will use and protect confidential information solely for authorized Company purposes, will not misuse or disclose confidential information except as permitted by Company policy or law, and will follow the confidential information definition set out in Cover Terms."
        },
        {
          "heading": "No Conflicting Obligations",
          "body": "Employee represents that performing duties for Company does not knowingly conflict with binding obligations to another person or entity. Employee will not bring third-party confidential information into Company systems or use it in Company work without written authorization."
        },
        {
          "heading": "Records, Cooperation, and Post-Termination Assistance",
          "body": "Employee will provide the post-termination assistance listed in Cover Terms, including reasonable cooperation with filings, declarations, and assignments needed to confirm or protect Company rights in covered inventions, subject to reimbursement of reasonable out-of-pocket expenses when required by policy."
        },
        {
          "heading": "Return and Deletion of Materials",
          "body": "Employee will return, and where permitted delete, Company materials within the timing listed in Cover Terms, including devices, documents, credentials, and confidential files, except for records Employee is required to retain by law."
        },
        {
          "heading": "Survival and Limited Scope",
          "body": "Sections addressing assignment, confidentiality, return of materials, and assistance survive termination to the extent needed to enforce rights that arose during employment. This agreement does not transfer ownership of inventions that applicable law requires to remain with Employee."
        },
        {
          "heading": "Governing Law and Venue",
          "body": "This agreement is governed by the law listed in Cover Terms, and disputes will be resolved in the venue listed in Cover Terms, subject to non-waivable rights under applicable law."
        }
      ]
    },
    "signature": {
      "mode": "two-party",
      "section_label": "Signature Page",
      "heading_title": "Signatures",
      "preamble": "By signing this agreement, each party acknowledges and agrees to the assignment and confidentiality obligations above.",
      "party_a": "Company",
      "party_b": "Employee",
      "rows": [
        { "label": "Signature" },
        { "label": "Print Name", "left": "{company_name}", "right": "{employee_name}" },
        { "label": "Title" },
        { "label": "Date" }
      ]
    }
  }
}
